// Данные меню ресторана
const menuData = {
    restaurant: {
        name: "🍕 гастропаб 'БУНКЕР'",
        description: "Сочетание пиццы и бургеров"
    },
    
    categories: [
        {
            id: "pizza",
            name: "🍕 Пицца",
            description: "Настоящая итальянская пицца"
        },
        {
            id: "rebra",
            name: "🍕 Ребра",
            description: "свиные ребра с гарниром"
        },
        {
            id: "pasta", 
            name: "🍝 Паста",
            description: "Свежая паста ручной работы"
        },
        {
            id: "salads",
            name: "🥗 Салаты",
            description: "Свежие салаты"
        },
        {
            id: "drinks",
            name: "🥤 Напитки", 
            description: "Освежающие напитки"
        }
    ],
    
    items: [
        // ПИЦЦА
        {
            id: 1,
            category: "pizza",
            name: "Маргарита",
            description: "Томатный соус, моцарелла, базилик",
            price: 450,
            image: "🍕",
            weight: "450г"
        },
        {
            id: 2,
            category: "pizza", 
            name: "Пепперони",
            description: "Томатный соус, моцарелла, пепперони",
            price: 550,
            image: "🍕",
            weight: "500г"
        },
        {
            id: 3,
            category: "pizza",
            name: "4 Сыра", 
            description: "Моцарелла, горгонзола, пармезан, рикотта",
            price: 600,
            image: "🍕",
            weight: "480г"
        },
        {
            id: 4,
            category: "pizza",
            name: "СТАС",
            description: "Томатный соус, моцарелла, базилик",
            price: 450,
            image: "🍕",
            weight: "450г"
        },
        // ПАСТА
        {
            id: 7,
            category: "pasta",
            name: "Карбонара",
            description: "Спагетти, бекон, сыр, яйцо",
            price: 420,
            image: "🍝", 
            weight: "350г"
        },
        
        // САЛАТЫ
        {
            id: 8,
            category: "salads",
            name: "Цезарь",
            description: "Курица, салат, сухарики, соус цезарь",
            price: 320,
            image: "🥗",
            weight: "280г"
        },
        
        // НАПИТКИ
        {
            id: 6, 
            category: "drinks",
            name: "Кола",
            description: "Coca-Cola 0.5л",
            price: 120,
            image: "🥤",
            volume: "500мл"
        }
    ]
};